# IdeaStatiCa.ConnectionApi.Model.ConPlateCutOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**ModifiedObject** | **ConCutByTarget** |  |
**CutBy** | **ConCutByTarget** |  |
**CuttingMethod** | **ConCuttingMethod** |  | [optional]
**RemainingPart** | **ConPlateSide** |  | [optional]
**Offset** | **double** |  | [optional]
**Weld** | **ConWeldData** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)